src/test/resources/getEmployeeByGender.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:emp="http://www.gunnarro.com/employee">
    <soapenv:Header/>
    <soapenv:Body>
        <emp:EmployeeByGenderRequest>
            <gender>M</gender>
        </emp:EmployeeByGenderRequest>
    </soapenv:Body>
</soapenv:Envelope>